## Staging: ses_receiving_emails
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.ses_recieving_emails_sqs_send will be created
  + resource "aws_iam_policy" "ses_recieving_emails_sqs_send" {
      + arn         = (known after apply)
      + description = "IAM policy for sending messages to SQS from Lambda"
      + id          = (known after apply)
      + name        = "ses_recieving_email_sqs_send"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:Get*",
                          + "sqs:SendMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.ses_recieving_emails_sqs_send will be created
  + resource "aws_iam_role_policy_attachment" "ses_recieving_emails_sqs_send" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "arn:aws:iam::239043911459:role/ses_receiving_emails"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>